In [0]:
import requests
res = requests.get('https://news.ltn.com.tw/list/breakingnews')

In [2]:
res

In [0]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text,'lxml')

In [0]:
newsary = []
for li in soup.select('ul.list li'):
  #print(li)
  title = li.select_one('.title').text
  dt = li.select_one('.time').text
  link = li.select_one('a').get('href')
  newsary.append({'title':title, 'time': dt, 'link':link})

In [16]:
import pandas
newsdf = pandas.DataFrame(newsary)
newsdf.head()

                       title  ...                                               link
0                5/9重要財經新聞一覽  ...  https://ec.ltn.com.tw/article/breakingnews/315...
1  台灣史前館開館19年首次大改造  本月底封館到明年  ...  https://news.ltn.com.tw/news/life/breakingnews...
2  「我不是股神的粉絲」馬斯克：巴菲特的工作真的很無聊  ...  https://ec.ltn.com.tw/article/breakingnews/315...
3   武漢肺炎疫情任務  學者：中國解放軍發揮兵力有限  ...  https://news.ltn.com.tw/news/world/breakingnew...
4  今晴朗炎熱！明晚梅雨季首道鋒面到 全台嚴防劇烈天氣  ...  https://news.ltn.com.tw/news/life/breakingnews...

[5 rows x 3 columns]

## 自由時報爬蟲

In [0]:
import requests
res = requests.get('https://news.ltn.com.tw/ajax/breakingnews/all/4')

In [0]:
jd = res.json()

In [0]:
import pandas
df = pandas.DataFrame(jd['data'].values())
#df

In [0]:
import time
newsary = []

for i in range(2,5):
  res = requests.get('https://news.ltn.com.tw/ajax/breakingnews/all/{}'.format(i))
  time.sleep(2)
  #print(res.json())
  jd = res.json()
  df = pandas.DataFrame(jd['data'].values())
  newsary.append(df)

In [0]:
newsdf = pandas.concat(newsary)

In [118]:
newsdf.head()

        no                                title  ... style tagText
0  3159956             投票日為立委候選人發簡訊拉票 男子恐被罰50萬元  ...  None      社會
1  3159955          罷韓團體深夜「洗地板」 高市府：清潔同仁維護市容很辛苦  ...  None      政治
2  3159953           中國助藍營、韓國瑜賄選案 陸委會：不適用「反滲透法」  ...  None      政治
3  3159926       軍情動態》軍用無人機也能用租的！希臘向以色列租用多架防禦邊境  ...  None      國際
4    40346  今年第一季手機銷售排行 Top 10 出爐！Android 旗艦全陣亡  ...  None      3C

[5 rows x 17 columns]

## Numpy

In [0]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [19]:
for i in range(len(a)):
  print(a[i] * b[i])

2
12
30
56
90

In [20]:
for rec in zip(a,b):
  print(rec)

(1, 2)
(3, 4)
(5, 6)
(7, 8)
(9, 10)

In [21]:
for i,j in zip(a,b):
  print(i*j)

2
12
30
56
90

In [0]:
import numpy

In [0]:
na = numpy.array(a)
nb = numpy.array(b)

In [24]:
na * nb

array([ 2, 12, 30, 56, 90])

In [0]:
import numpy as np
my_list = [1,2,3]
np_my_list = np.array(my_list)

In [26]:
type(my_list)

list

In [27]:
type(np_my_list)

numpy.ndarray

In [28]:
my_list.append(4)
my_list

[1, 2, 3, 4]

In [29]:
np_my_list.append(4)

AttributeError: ignored

In [30]:
my_matrix =[[1,2,3],[4,5,6],[7,8,9]]
np.array(my_matrix)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [32]:
np.arange(0,10)
np.arange(0,11,2)

array([ 0,  2,  4,  6,  8, 10])

In [36]:
np.zeros(3)
np.zeros((5,5))
np.ones(3)
np.ones((3,3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [39]:
np.linspace(0,10,3)
#np.linspace(0,10,50)

array([ 0.,  5., 10.])

In [40]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [46]:
np.random.rand(2)
np.random.rand(5,5)
np.random.randn(2)
np.random.randn(5,5)
np.random.randint(1,100)
np.random.randint(1,42,6)

array([14,  2, 28,  1, 38, 24])

In [49]:
arr = np.arange(25)
arr
arr.reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [0]:
ranarr =np.random.randint(0,50,10)

In [55]:
ranarr

array([41,  6,  8, 15,  4,  3, 41, 28, 39, 11])

In [59]:
ranarr.max()
ranarr.argmax()
ranarr.min()
ranarr.argmin()

5

In [60]:
arr.shape

(25,)

In [61]:
arr.reshape(1,25)

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15,
        16, 17, 18, 19, 20, 21, 22, 23, 24]])

In [62]:
arr.reshape(1,25).shape

(1, 25)

In [63]:
arr.reshape(25,1)
arr.reshape(25,1).shape

(25, 1)

In [64]:
arr.dtype

dtype('int64')

In [66]:
arr = np.arange(0,11)
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [68]:
arr[8]
arr[1:5]

array([1, 2, 3, 4])

In [70]:
arr = np.arange(0,11)
slice_of_arr = arr[0:6]
slice_of_arr

array([0, 1, 2, 3, 4, 5])

In [0]:
slice_of_arr[:]=99

In [72]:
arr

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [73]:
arr_2d = np.array(([5,10,15],[20,25,30],[35,40,45]))
arr_2d

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [74]:
arr_2d[1]

array([20, 25, 30])

In [75]:
arr_2d[1][0]

20

In [76]:
arr_2d[1,0]

20

In [77]:
arr_2d[2]

array([35, 40, 45])

In [78]:
arr_2d[2,:]

array([35, 40, 45])

In [80]:
arr = np.arange(1,11)
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [83]:
arr > 4
bool_arr = arr>4
bool_arr

array([False, False, False, False,  True,  True,  True,  True,  True,
        True])

In [84]:
arr[bool_arr]

array([ 5,  6,  7,  8,  9, 10])

In [0]:
arr = np.arange(0,10)

In [91]:
arr + arr
arr * arr
arr - arr
arr/arr
1/arr
arr**3

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: RuntimeWarning: invalid value encountered in true_divide
  after removing the cwd from sys.path.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: RuntimeWarning: divide by zero encountered in true_divide
  """

array([  0,   1,   8,  27,  64, 125, 216, 343, 512, 729])

In [96]:
np.sqrt(arr)
np.exp(arr)
np.max(arr)
np.sin(arr)
np.log(arr)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: RuntimeWarning: divide by zero encountered in log
  """

array([      -inf, 0.        , 0.69314718, 1.09861229, 1.38629436,
       1.60943791, 1.79175947, 1.94591015, 2.07944154, 2.19722458])

In [97]:
x = np.array([1,2,3,4])
w1 = np.random.randn(4,5)
w1

array([[-1.52107409, -0.02094996, -0.60103684, -1.43694666, -0.24985876],
       [-1.27630083, -1.18650098, -0.40011362, -0.72616762,  0.41418953],
       [ 0.57777188, -0.05149915,  0.90496268,  0.89425989, -2.01482075],
       [ 0.3847239 , -1.94383445,  0.97267206, -1.45304797, -0.46475448]])

In [98]:
np.dot(x,w1)

array([ -0.80146449, -10.32378719,   5.2043122 ,  -6.0186941 ,
        -7.3249599 ])

In [0]:
w2 = np.random.randn(5,3)

In [100]:
np.dot(np.dot(x,w1),w2)

array([-5.80383553, 28.10312297, -3.63173805])

## Pandas

In [0]:
na = np.array([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M',35], 
               ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [120]:
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U5')

In [121]:
na[:,2]

array(['29', '23', '35', '33', '21', '20'], dtype='<U5')

In [123]:
na[:,2].astype(int).mean()

26.833333333333332

In [0]:
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [125]:
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U6')

In [128]:
na[1:,2].astype(int).mean()

26.833333333333332

In [131]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
                    ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
#print(df)
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [132]:
df.columns=['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

## Pandas Series

In [0]:
import numpy as np
import pandas as pd

In [0]:
labels = ['a','b','c']
my_list = [10,20,30]

In [135]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [136]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [0]:
s = pd.Series(my_list,labels)

In [139]:
s[0]

10

In [140]:
s['a']

10

In [141]:
d = {'a':10,'b':20,'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [0]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA','Germany','Italy', 'Japan'])

In [143]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [144]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [145]:
ser1['USA']

1

In [146]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [0]:
# nan: not a number

## Pandas DataFrame

In [148]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [0]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted','M', 33],
                   ['jean', 'F', 21], ['lisa', 'F', 20]], columns = ['name', 'gender', 'age'])

In [0]:
df = pd.DataFrame([{'name':'frank','gender':'M', 'age':29}, 
{'name':'mary','gender':'F', 'age':23}, 
{'name':'tom','gender':'M', 'age':35}, 
{'name':'ted','gender':'M', 'age':33}, 
{'name':'jean','gender':'F', 'age':21}, 
{'name':'lisa','gender':'F', 'age':20}])

In [0]:
df = pd.DataFrame([{'name': 'qoo', 'age':12, 'gender':'M'}, 
 {'name': 'Mary', 'gender': 'F'}])

In [152]:
df

   name   age gender
0   qoo  12.0      M
1  Mary   NaN      F

In [0]:
df = pd.DataFrame([{'name':'frank','gender':'M', 'age':29}, 
{'name':'mary','gender':'F', 'age':23}, 
{'name':'tom','gender':'M', 'age':35}, 
{'name':'ted','gender':'M', 'age':33}, 
{'name':'jean','gender':'F', 'age':21}, 
{'name':'lisa','gender':'F', 'age':20}])

In [155]:
df.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [157]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   gender  6 non-null      object
 2   age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [159]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [160]:
df.dtypes

name      object
gender    object
age        int64
dtype: object

In [161]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [162]:
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [163]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [164]:
df[df['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [165]:
df[(df['gender'] == 'M') & (df['age'] >= 30) ]

  name gender  age
2  tom      M   35
3  ted      M   33

In [166]:
df[(df['gender'] == 'M') | (df['age'] >= 30) ]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [0]:
df['employee']= True

In [168]:
df.head()

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True

In [0]:
del df['employee']

In [170]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [171]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [0]:
df.loc[6] = {'age':20,'gender':'F','name':'qoo'}

In [173]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20
6    qoo      F   20

In [174]:
pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),

(   age gender name
 0   20      F  qoo,)

In [175]:
df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),
ignore_index=True)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20
6    qoo      F   20
7    qoo      F   20

In [0]:
df.drop(6, axis = 0, inplace=True)

In [179]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [0]:
df['userid'] = range(101,107)

In [181]:
df

    name gender  age  userid
0  frank      M   29     101
1   mary      F   23     102
2    tom      M   35     103
3    ted      M   33     104
4   jean      F   21     105
5   lisa      F   20     106

In [0]:
df.set_index('userid', inplace=True)

In [183]:
df

         name gender  age
userid
101     frank      M   29
102      mary      F   23
103       tom      M   35
104       ted      M   33
105      jean      F   21
106      lisa      F   20

In [184]:
# iloc: by 位置
df.iloc[1]

name      mary
gender       F
age         23
Name: 102, dtype: object

In [185]:
df.iloc[[1,3,5]]

        name gender  age
userid
102     mary      F   23
104      ted      M   33
106     lisa      F   20

In [186]:
# loc: by 索引
df.loc[103]

name      tom
gender      M
age        35
Name: 103, dtype: object

In [187]:
df.loc[[103,105], ['name', 'age']]

        name  age
userid
103      tom   35
105     jean   21

In [188]:
df.iloc[[2,4], [0, 2]]

        name  age
userid
103      tom   35
105     jean   21

## 小任務
-　現在有三個客戶 David, Mary, John 購買了台積電的股票

- David 的購買價格是200, 賣出價格是 250
- Mary 的購買價格是 300, 賣出價格是 325
- John 的購買價格是 300, 賣出價格是270

- 請協助我將他們的名字, 購買價, 賣出價 建立一DataFrame df 並從中計算 每個人的投資報酬率, 最後篩選出有正報酬的投資者?

In [0]:
df = pd.DataFrame([
 ['David', 200,250],
 ['Mary', 300,325], 
 ['John', 300,270],   
], columns = ['名字','購買價','賣出價'])

In [0]:
df['投資報酬率'] = (df['賣出價'] - df['購買價']) / df['購買價']

In [194]:
df[df['投資報酬率'] > 0]

      名字  購買價  賣出價     投資報酬率
0  David  200  250  0.250000
1   Mary  300  325  0.083333

In [195]:
df[df['投資報酬率'] > 0]['名字']

0    David
1     Mary
Name: 名字, dtype: object

In [196]:
df.loc[df['投資報酬率'] > 0, '名字']

0    David
1     Mary
Name: 名字, dtype: object

##處理缺失值

In [197]:
import pandas as pd
import numpy as np
df = pd.DataFrame([
['frank', 'M', np.nan], 
['mary', np.nan, np.nan], 
['tom' , 'M', 35], 
['ted' , 'M', 33], 
['jean' , np.nan, 21], 
['lisa', 'F', 20]])
df.columns = ['name', 'gender', 'age']
df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [198]:
df['gender'].notnull()

0     True
1    False
2     True
3     True
4    False
5     True
Name: gender, dtype: bool

In [199]:
df['gender'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: gender, dtype: bool

In [200]:
df['name'].isnull().values

array([False, False, False, False, False, False])

In [201]:
df['name'].isnull().values.any()

False

In [202]:
df.isnull().values.any()

True

In [204]:
df.isnull().sum()

name      0
gender    2
age       2
dtype: int64

In [205]:
df.isnull().sum().sum()

4

In [206]:
df.dropna()

   name gender   age
2   tom      M  35.0
3   ted      M  33.0
5  lisa      F  20.0

In [207]:
df.dropna(how= 'all')

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [208]:
df.dropna(thresh=2)

    name gender   age
0  frank      M   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [0]:
df['employee'] = np.nan

In [210]:
df

    name gender   age  employee
0  frank      M   NaN       NaN
1   mary    NaN   NaN       NaN
2    tom      M  35.0       NaN
3    ted      M  33.0       NaN
4   jean    NaN  21.0       NaN
5   lisa      F  20.0       NaN

In [0]:
df.dropna(axis = 1, how='all', inplace=True)

In [214]:
df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [215]:
df.fillna(0)

    name gender   age
0  frank      M   0.0
1   mary      0   0.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      0  21.0
5   lisa      F  20.0

In [216]:
df["age"].mean()

27.25

In [217]:
df['age'].fillna(df["age"].mean())

0    27.25
1    27.25
2    35.00
3    33.00
4    21.00
5    20.00
Name: age, dtype: float64

In [220]:
df.groupby("gender")["age"].mean()

gender
F    20.0
M    34.0
Name: age, dtype: float64

In [221]:
df.groupby("gender")["age"].transform("mean")

0    34.0
1     NaN
2    34.0
3    34.0
4     NaN
5    20.0
Name: age, dtype: float64

In [222]:
df['age'].fillna(df.groupby("gender")["age"].transform("mean"))

0    34.0
1     NaN
2    35.0
3    33.0
4    21.0
5    20.0
Name: age, dtype: float64

In [223]:
df.fillna(method='pad')

    name gender   age
0  frank      M   NaN
1   mary      M   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean      M  21.0
5   lisa      F  20.0

In [224]:
df.fillna(method='bfill', limit=2)

    name gender   age
0  frank      M  35.0
1   mary      M  35.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      F  21.0
5   lisa      F  20.0

In [0]:
df2 = pd.DataFrame([[1, 870],\
[2, 900],
[np.nan, np.nan],
[4, 950],
[5,1080],
[6,1200]])
df2.columns = ['time','val']

In [226]:
df2.interpolate()

   time     val
0   1.0   870.0
1   2.0   900.0
2   3.0   925.0
3   4.0   950.0
4   5.0  1080.0
5   6.0  1200.0

## 數據轉換

In [231]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv',index_col=0)
df.head()

        id          address  floor  ...  area    price  browsenum_all
0  6032971  永康街47巷永康街五樓頂加..      5  ...  46.8   60,000            751
1  6054083   仁愛路四段仁愛路樹海景觀..      7  ...  76.9  100,000            162
2  5957980   光復南路高樓層大巨蛋正對..     10  ...  71.3  150,000           2385
3  6043839     永康街23巷永康商圈..      3  ...  18.0   29,000           1323
4  5181793      雲和街師大*已收訂..      5  ...  28.0   31,800           2303

[5 rows x 8 columns]

In [0]:
df['square_feet'] = df['area'] / 0.3025

In [235]:
df.head()

        id          address  floor  ...    price browsenum_all  square_feet
0  6032971  永康街47巷永康街五樓頂加..      5  ...   60,000           751   154.710744
1  6054083   仁愛路四段仁愛路樹海景觀..      7  ...  100,000           162   254.214876
2  5957980   光復南路高樓層大巨蛋正對..     10  ...  150,000          2385   235.702479
3  6043839     永康街23巷永康商圈..      3  ...   29,000          1323    59.504132
4  5181793      雲和街師大*已收訂..      5  ...   31,800          2303    92.561983

[5 rows x 9 columns]

In [236]:
df['price'] / df['area']

TypeError: ignored

In [237]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             720 non-null    int64
 1   address        720 non-null    object
 2   floor          720 non-null    int64
 3   allfloor       720 non-null    int64
 4   layout         720 non-null    object
 5   area           720 non-null    float64
 6   price          720 non-null    object
 7   browsenum_all  720 non-null    int64
 8   square_feet    720 non-null    float64
dtypes: float64(2), int64(4), object(3)
memory usage: 56.2+ KB

In [239]:
s = '60,000'
int(s.replace(',', ''))

60000

In [0]:
def normalizePrice(ele):
  return int(ele.replace(',', ''))

In [241]:
normalizePrice(s)

60000

In [243]:
df['price'].map(normalizePrice)

0      60000
1     100000
2     150000
3      29000
4      31800
       ...
25     55000
26     50000
27     30000
28     48000
29     43000
Name: price, Length: 720, dtype: int64

In [0]:
def square2(e):
  return e ** 2

In [0]:
s2 = lambda e: e ** 2

In [246]:
s2(3)

9

In [0]:
def normalizePrice(ele):
  return int(ele.replace(',', ''))
normalizePrice = lambda ele : int(ele.replace(',', ''))

In [0]:
df['price'] = df['price'].map(lambda ele : int(ele.replace(',', '')))

In [251]:
df.head()

        id          address  floor  ...   price browsenum_all  square_feet
0  6032971  永康街47巷永康街五樓頂加..      5  ...   60000           751   154.710744
1  6054083   仁愛路四段仁愛路樹海景觀..      7  ...  100000           162   254.214876
2  5957980   光復南路高樓層大巨蛋正對..     10  ...  150000          2385   235.702479
3  6043839     永康街23巷永康商圈..      3  ...   29000          1323    59.504132
4  5181793      雲和街師大*已收訂..      5  ...   31800          2303    92.561983

[5 rows x 9 columns]

In [252]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             720 non-null    int64
 1   address        720 non-null    object
 2   floor          720 non-null    int64
 3   allfloor       720 non-null    int64
 4   layout         720 non-null    object
 5   area           720 non-null    float64
 6   price          720 non-null    int64
 7   browsenum_all  720 non-null    int64
 8   square_feet    720 non-null    float64
dtypes: float64(2), int64(5), object(2)
memory usage: 56.2+ KB

In [0]:
df = pd.DataFrame(
[[60,70,50],
[80,79,68],
[63,66,82]], 
columns = ['First', 'Second', 'Third'])

In [254]:
df.apply(lambda e: e.max() - e.min(), axis = 0)

First     20
Second    13
Third     32
dtype: int64

In [255]:
df.apply(lambda e: e.max() - e.min(), axis = 1)

0    20
1    12
2    19
dtype: int64

In [256]:
import numpy as np
df.applymap(lambda e: '-' if pandas.isnull(e)else e)

   First  Second  Third
0     60      70     50
1     80      79     68
2     63      66     82

In [257]:
import numpy as np
df.applymap(lambda e:  'good' if e >=80 else 'bad')

  First Second Third
0   bad    bad   bad
1  good    bad   bad
2   bad    bad  good

## 時間格式轉換

In [0]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample2.csv')

In [259]:
df.head()

   Unnamed: 0  ...   longitude
0           0  ...  120.250810
1           1  ...  121.461868
2           2  ...  121.511328
3           3  ...  120.538032
4           4  ...  121.141518

[5 rows x 12 columns]

In [0]:
from datetime import datetime, date
current_time = datetime.now()
current_date = date(2020,5,9)

In [264]:
current_time

datetime.datetime(2020, 5, 9, 5, 39, 32, 894792)

In [265]:
current_date

datetime.date(2020, 5, 9)

In [266]:
current_time.strftime('%Y-%m-%d')

'2020-05-09'

In [0]:
dt  = datetime.strptime('2020-05-01', '%Y-%m-%d')

In [269]:
current_time - dt

datetime.timedelta(8, 20372, 894792)

In [272]:
from datetime import timedelta
dt = date(2020,5,1)
dt - timedelta(days = 1)

datetime.date(2020, 4, 30)

In [274]:
for i in range(10):
  dtstr = dt - timedelta(days = i)
  print(dtstr.strftime('%Y-%m-%d'))

2020-05-01
2020-04-30
2020-04-29
2020-04-28
2020-04-27
2020-04-26
2020-04-25
2020-04-24
2020-04-23
2020-04-22

In [0]:
import requests
import time
ary = []
for i in range(10):
  dtstr = dt - timedelta(days = i)
  datestr = dtstr.strftime('%Y%m%d')
  res = requests.get('https://www.twse.com.tw/exchangeReport/MI_INDEX?response=json&date={}&type=24'.format(datestr))
  jd = res.json()
  ary.append(jd)
  time.sleep(3)

In [0]:
import pandas
df = pandas.DataFrame(ary[1]['data1'], columns = ary[1]['fields1'])

In [0]:
dfary = []
for ele in ary:
  if ele.get('data1'):
    df = pandas.DataFrame(ele['data1'], columns = ele['fields1'])
    dfary.append(df)

In [289]:
stockdf = pandas.concat(dfary)
stockdf.head(3)

   證券代號 證券名稱        成交股數    成交筆數  ... 最後揭示買量 最後揭示賣價 最後揭示賣量    本益比
0  2302   麗正     139,714      82  ...      5   7.45     52
1  2303   聯電  64,768,656  11,380  ...  4,097  15.55    569  17.67
2  2329   華泰   7,250,143   2,091  ...     55  12.35    206  11.76

[3 rows x 16 columns]

In [291]:
from time import mktime
current_time = datetime.now()
current_time.timetuple()
mktime(current_time.timetuple())

1589003777.0

In [292]:
datetime.fromtimestamp(1555860118)

datetime.datetime(2019, 4, 21, 15, 21, 58)

In [294]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample2.csv', index_col = 0)
df.head()

                                         detail_url  ...   longitude
0  https://rent.591.com.tw/rent-detail-1050934.html  ...  120.250810
1  https://rent.591.com.tw/rent-detail-1008046.html  ...  121.461868
2  https://rent.591.com.tw/rent-detail-1586266.html  ...  121.511328
3  https://rent.591.com.tw/rent-detail-1699948.html  ...  120.538032
4  https://rent.591.com.tw/rent-detail-1404725.html  ...  121.141518

[5 rows x 11 columns]

In [0]:
import pandas
df['search_date'] = pandas.to_datetime(df['search_date'], format = '%Y-%m-%d')

In [297]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70315 entries, 0 to 70314
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   detail_url     70315 non-null  object
 1   search_date    70315 non-null  datetime64[ns]
 2   title          70315 non-null  object
 3   address        70315 non-null  object
 4   floor_info     69686 non-null  object
 5   price          70315 non-null  object
 6   layout         22630 non-null  object
 7   building_area  70315 non-null  float64
 8   building_use   65330 non-null  object
 9   latitude       70315 non-null  float64
 10  longitude      70315 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(7)
memory usage: 6.4+ MB

In [301]:
df[df['search_date'] >= '2017-05-13'].head()

                                         detail_url  ...   longitude
0  https://rent.591.com.tw/rent-detail-1050934.html  ...  120.250810
1  https://rent.591.com.tw/rent-detail-1008046.html  ...  121.461868
3  https://rent.591.com.tw/rent-detail-1699948.html  ...  120.538032
6  https://rent.591.com.tw/rent-detail-1299940.html  ...  120.986334
7  https://rent.591.com.tw/rent-detail-1051432.html  ...  120.645027

[5 rows x 11 columns]

In [303]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample2.csv', index_col = 0,parse_dates =['search_date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70315 entries, 0 to 70314
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   detail_url     70315 non-null  object
 1   search_date    70315 non-null  datetime64[ns]
 2   title          70315 non-null  object
 3   address        70315 non-null  object
 4   floor_info     69686 non-null  object
 5   price          70315 non-null  object
 6   layout         22630 non-null  object
 7   building_area  70315 non-null  float64
 8   building_use   65330 non-null  object
 9   latitude       70315 non-null  float64
 10  longitude      70315 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(7)
memory usage: 6.4+ MB

## 虛擬變量

In [304]:
df.head()

                                         detail_url  ...   longitude
0  https://rent.591.com.tw/rent-detail-1050934.html  ...  120.250810
1  https://rent.591.com.tw/rent-detail-1008046.html  ...  121.461868
2  https://rent.591.com.tw/rent-detail-1586266.html  ...  121.511328
3  https://rent.591.com.tw/rent-detail-1699948.html  ...  120.538032
4  https://rent.591.com.tw/rent-detail-1404725.html  ...  121.141518

[5 rows x 11 columns]

In [306]:
df['building_use'].unique()

array(['透天厝/獨立套房', '電梯大樓/分租套房', '透天厝/分租套房', '電梯大樓/整層住家', '電梯大樓/雅房',
       '透天厝/雅房', '電梯大樓/獨立套房', '公寓/獨立套房', '透天厝/辦公', '透天厝/住辦', '透天厝/整層住家',
       '透天厝/店面', '公寓/整層住家', '電梯大樓/店面', '別墅/獨立套房', '公寓/分租套房', nan,
       '電梯大樓/住辦', '電梯大樓/辦公', '公寓/店面', '公寓/辦公', '公寓/雅房', '別墅/分租套房',
       '別墅/整層住家', '公寓/住辦', '別墅/店面', '別墅/住辦', '倉庫/其他', '透天厝/其他', '電梯大樓/其他',
       '廠房/其他', '別墅/辦公', '別墅/其他', '廠辦/其他', '別墅/雅房', '公寓/其他', '其他/其他'],
      dtype=object)

In [0]:
import pandas
building_use = pandas.get_dummies(df['building_use'])

In [0]:
df = pd.concat([df, pandas.get_dummies(df['building_use'])], axis=1)

In [311]:
df.head(3)

                                         detail_url  ... 電梯大樓/雅房
0  https://rent.591.com.tw/rent-detail-1050934.html  ...       0
1  https://rent.591.com.tw/rent-detail-1008046.html  ...       0
2  https://rent.591.com.tw/rent-detail-1586266.html  ...       0

[3 rows x 47 columns]

In [0]:
df.drop('building_use', axis=1, inplace=True)

In [313]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample2.csv', index_col = 0,parse_dates =['search_date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70315 entries, 0 to 70314
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   detail_url     70315 non-null  object
 1   search_date    70315 non-null  datetime64[ns]
 2   title          70315 non-null  object
 3   address        70315 non-null  object
 4   floor_info     69686 non-null  object
 5   price          70315 non-null  object
 6   layout         22630 non-null  object
 7   building_area  70315 non-null  float64
 8   building_use   65330 non-null  object
 9   latitude       70315 non-null  float64
 10  longitude      70315 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(7)
memory usage: 6.4+ MB

In [315]:
s = '透天厝/獨立套房'
s.split('/')[0]

'透天厝'

In [0]:
df.dropna(inplace=True)
df['btype'] = df['building_use'].map(lambda s: s.split('/')[0])
df['buse'] = df['building_use'].map(lambda s: s.split('/')[1])

In [0]:
df['price'] = df['price'].map(lambda s: int(s.replace('元/月','').replace(',','')))

In [324]:
df.pivot_table(index = 'btype', columns = 'buse', values = 'price', aggfunc=sum)

buse           住辦          其他         整層住家
btype
倉庫            NaN   1346415.0          NaN
公寓      5873999.0    556799.0   57290660.0
其他            NaN     17100.0          NaN
別墅       940100.0   2311700.0   22684795.0
廠房            NaN   2598200.0          NaN
廠辦            NaN   2195000.0          NaN
透天厝     8044798.0   3680399.0   33155785.0
電梯大樓   25806079.0  15918990.0  536152115.0

In [325]:
df.pivot_table(index = 'buse', columns = 'btype', values = 'price', aggfunc=sum)

btype         倉庫          公寓       其他  ...         廠辦         透天厝         電梯大樓
buse                                   ...
住辦           NaN   5873999.0      NaN  ...        NaN   8044798.0   25806079.0
其他     1346415.0    556799.0  17100.0  ...  2195000.0   3680399.0   15918990.0
整層住家         NaN  57290660.0      NaN  ...        NaN  33155785.0  536152115.0

[3 rows x 8 columns]

## Pandas Aggregation

In [326]:
df.head(3)

                                          detail_url search_date  ... btype  buse
5   https://rent.591.com.tw/rent-detail-1633388.html  2017-05-12  ...  電梯大樓  整層住家
9   https://rent.591.com.tw/rent-detail-1245175.html  2017-05-14  ...  電梯大樓  整層住家
13  https://rent.591.com.tw/rent-detail-2042141.html  2017-05-14  ...  電梯大樓  整層住家

[3 rows x 13 columns]

In [0]:
# SELECT btype, AVG(price) FROM df GROUP BY btype;

In [328]:
df.groupby('btype')['price'].mean()

btype
倉庫       25404.056604
公寓       19906.734770
其他        5700.000000
別墅       52716.656504
廠房       76417.647059
廠辦      104523.809524
透天厝      23796.915164
電梯大樓     35167.793574
Name: price, dtype: float64

In [329]:
df.groupby(['btype', 'buse'])['price'].mean()

btype  buse
倉庫     其他       25404.056604
公寓     住辦       28105.258373
       其他       18559.966667
       整層住家     19341.883862
其他     其他        5700.000000
別墅     住辦       58756.250000
       其他       59274.358974
       整層住家     51910.286041
廠房     其他       76417.647059
廠辦     其他      104523.809524
透天厝    住辦       35596.451327
       其他       32284.201754
       整層住家     21446.173997
電梯大樓   住辦       42305.047541
       其他       85128.288770
       整層住家     34291.788615
Name: price, dtype: float64

In [330]:
df.groupby(['btype', 'buse'])['price'].sum()

btype  buse
倉庫     其他        1346415
公寓     住辦        5873999
       其他         556799
       整層住家     57290660
其他     其他          17100
別墅     住辦         940100
       其他        2311700
       整層住家     22684795
廠房     其他        2598200
廠辦     其他        2195000
透天厝    住辦        8044798
       其他        3680399
       整層住家     33155785
電梯大樓   住辦       25806079
       其他       15918990
       整層住家    536152115
Name: price, dtype: int64

In [331]:
df.groupby(['btype', 'buse'])['price'].std()

btype  buse
倉庫     其他       39361.417227
公寓     住辦       17006.354076
       其他       11587.334228
       整層住家     12681.761829
其他     其他        2066.397832
別墅     住辦       96429.103275
       其他       45813.671356
       整層住家     56040.851310
廠房     其他      111988.961768
廠辦     其他      128244.539473
透天厝    住辦       40912.738009
       其他       40159.674238
       整層住家     20980.709398
電梯大樓   住辦       39623.699360
       其他      173998.690249
       整層住家     32224.674029
Name: price, dtype: float64

In [334]:
df.groupby('btype')['price'].mean().sort_values(ascending= False)

btype
廠辦      104523.809524
廠房       76417.647059
別墅       52716.656504
電梯大樓     35167.793574
倉庫       25404.056604
透天厝      23796.915164
公寓       19906.734770
其他        5700.000000
Name: price, dtype: float64

## 小任務
- 請幫我統計
- 哪個商品的銷量最好?
- 哪個商品賣出的金額最高?

In [341]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/purchase_order.tab', header = None,sep = '\t', )
df.columns = ['date', 'action', 'uid', 'pid', 'qty', 'price']
df.head()

                  date action           uid             pid  qty   price
0  2015-07-01 00:00:01  order    U312622727     P0006944501    1  1069.0
1  2015-07-01 00:00:03  order    U239012343     P0006018073    1  1680.0
2  2015-07-01 00:00:19  order  U10007697373     P0002267974    1   285.0
3  2015-07-01 00:01:10  order    U296328517     P0016144236    1   550.0
4  2015-07-01 00:01:36  order    U300884570  P0014516980122    1   249.0